{
    "38" : "Bucharest (UK: /ˌbuːkəˈrɛst/ BOO-kə-REST, US: /ˈbuːkərɛst/ -⁠rest; Romanian: București [bukuˈreʃtʲ] ⓘ) is the capital and largest city of Romania. The metropolis stands on the River Dâmbovița in south-eastern Romania. Its population is officially estimated at 1.76 million residents within a greater metropolitan area of 2.3 million residents, which makes Bucharest the 8th most-populous city in the European Union. The city area measures 240 km2 and comprises 6 districts (Sectoare), while the metropolitan area covers 1,811 km2. Bucharest is a beta global city, a major cultural, political and economic hub, and the country's seat of government.",
    "39":"Cluj-Napoca, commonly known as Cluj, is the second most populous city in Romania and the unofficial capital of the historical region of Transylvania. With a population of approximately 286npm,000 inhabitants, Cluj-Napoca is a major cultural, academic, and economic center. The city is home to Babeș-Bolyai University, the largest university in the country, which significantly contributes to the city's vibrant academic atmosphere. Cluj-Napoca is renowned for its rich history and architecture, featuring landmarks such as the Gothic-style St. Michael's Church, the Baroque-style Banffy Palace, and the modern Cluj Arena. The city spans an area of 179.5 km² and is known for its lively cultural scene, hosting numerous theaters, museums, and festivals such as the Transylvania International Film Festival. Cluj-Napoca is also a major hub for IT and innovation, often referred to as Romania's Silicon Valley.",
    "40":"Brașov is a picturesque city in Romania, located in the central part of the country and surrounded by the Southern Carpathians. It has a population of around 253,200 inhabitants and covers an area of 267.2 km². Brașov is famed for its well-preserved medieval Saxon walls and bastions, as well as the towering Gothic-style Black Church, one of the largest churches in Eastern Europe. The city's charming Old Town is a major draw for tourists, featuring cobblestone streets, colorful baroque buildings, and the impressive Council Square. Brașov is also a gateway to outdoor activities, with the nearby Poiana Brașov ski resort and various hiking trails in the surrounding mountains. The city's rich history, combined with its modern amenities, makes it a significant cultural and economic hub in the region.",
    "44":"Sofia is the capital and largest city of Bulgaria, with a population of approximately 1.26 million residents. Nestled at the foot of Vitosha Mountain in the western part of the country, Sofia covers an area of 492 km². As the political, economic, and cultural center of Bulgaria, Sofia boasts a rich history dating back to antiquity. The city is home to numerous historic landmarks, such as the Alexander Nevsky Cathedral, one of the largest Eastern Orthodox cathedrals in the world, the ancient Serdica complex, and the UNESCO World Heritage site Boyana Church. Sofia is also a vibrant cultural hub, offering a wide array of theaters, museums, and galleries, as well as a dynamic nightlife scene. The city's strategic location makes it a crucial transport and economic hub in the Balkans.",
    "45":"Plovdiv is the second-largest city in Bulgaria, with a population of around 345,000 residents. Situated in the southern part of the country, the city spans an area of 101.9 km² and is one of the oldest continuously inhabited cities in the world. Plovdiv is known for its diverse cultural heritage, which is reflected in its well-preserved Roman ruins, such as the ancient Roman theater and the Roman stadium, as well as the charming Old Town with its 19th-century Bulgarian Renaissance houses. The city hosts numerous cultural events, including the Plovdiv International Fair, the Opera Open festival, and the Night of Museums and Galleries. In 2019, Plovdiv was recognized as the European Capital of Culture, highlighting its rich artistic and historical legacy.",
    "46":"Varna is the third-largest city in Bulgaria and a major port on the Black Sea. With a population of around 335,000 residents, Varna spans an area of 238 km². Known as the maritime capital of Bulgaria, Varna is a key economic and cultural center in the country. The city boasts a rich history, dating back to ancient times, and is home to the oldest gold treasure in the world, the Varna Necropolis. Varna's architectural landmarks include the Dormition of the Mother of God Cathedral, the Roman Baths, and the Varna Opera House. The city is also famous for its vibrant cultural scene, hosting numerous festivals such as the Varna Summer International Music Festival and the International Ballet Competition. Additionally, Varna's beautiful beaches and seaside resorts make it a popular tourist destination, attracting visitors from around the globe. The combination of historical significance, cultural richness, and natural beauty makes Varna a unique and attractive city on the Black Sea coast.",
    "65":"Warsaw, the capital of Poland, is a vibrant city with a population of approximately 1.78 million residents. Covering an area of 517 km², Warsaw is situated on the Vistula River in east-central Poland. The city has a rich history marked by resilience and transformation, particularly after its extensive destruction during World War II. Warsaw's Old Town, meticulously reconstructed after the war, is a UNESCO World Heritage site featuring landmarks like the Royal Castle, the Warsaw Barbican, and the Sigismund's Column. The city is also a major cultural and economic center, home to institutions such as the National Museum, the Warsaw Philharmonic, and numerous theaters and galleries. Warsaw's modern skyline, characterized by skyscrapers like the Palace of Culture and Science, reflects its dynamic growth and development.",
    "66":"Kraków, one of the oldest and most beautiful cities in Poland, has a population of around 770,000 residents and spans an area of 327 km². Located on the Vistula River in southern Poland, Kraków is renowned for its well-preserved medieval core and Jewish quarter. The city's historic center, including the Main Market Square, St. Mary's Basilica, and the Wawel Castle, is a UNESCO World Heritage site. Kraków is also a significant academic hub, home to the Jagiellonian University, one of the oldest universities in the world. The city hosts numerous cultural events, such as the Kraków Film Festival, the Jewish Culture Festival, and the Conrad Festival, making it a vibrant cultural capital. Kraków's rich history, combined with its lively contemporary culture, attracts millions of tourists each year.",
    "67":"Łódź is the third-largest city in Poland, with a population of approximately 690,000 residents. Located in the central part of the country, Łódź covers an area of 293 km² and is known for its unique industrial heritage. The city experienced rapid growth during the 19th century as a major center of the textile industry, earning it the nickname \"Polish Manchester.\" Today, Łódź is undergoing a transformation, with revitalized factories and warehouses now serving as cultural and commercial spaces. Key attractions include Piotrkowska Street, one of the longest commercial streets in Europe, and Manufaktura, a large shopping and entertainment complex housed in a former textile factory. Łódź is also a cultural hub, hosting events such as the Łódź Design Festival and the Camerimage International Film Festival. The city's blend of industrial history and modern creativity makes it a unique destination in Poland.",
    "56":"Vienna, the capital of Austria, is a city of immense historical and cultural significance. With a population of about 1.9 million, it is the largest city in Austria. Vienna is known for its classical music heritage, being home to famous composers like Mozart and Beethoven. The city is characterized by its stunning architecture, including the Schönbrunn Palace, St. Stephen's Cathedral, and the Hofburg Imperial Palace. Vienna is also a UNESCO World Heritage site, recognized for its historical center. The city offers a high quality of life, frequently ranking at the top in global liveability indices. Its vibrant cultural scene includes numerous museums, theaters, and the world-renowned Vienna State Opera. Additionally, Vienna's coffee house culture is an integral part of its social fabric.",
    "57":"Graz, the second-largest city in Austria, has a population of around 330,000. It is renowned for its well-preserved medieval city center, which is a UNESCO World Heritage site. Key landmarks include the Schlossberg hill, with its iconic clock tower, and the Eggenberg Palace. Graz is also known for its vibrant cultural life, with numerous festivals, theaters, and museums. As a university city, it hosts a large student population, contributing to its dynamic atmosphere. Graz's culinary scene is also notable, particularly its local Styrian cuisine and wines.",
    "58":"Linz is the third-largest city in Austria, with a population of approximately 200,000. Situated along the Danube River, Linz is known for its blend of historical and contemporary architecture. Notable landmarks include the Lentos Art Museum, the Ars Electronica Center, and the historic Old Town with its baroque buildings. Linz has a rich industrial heritage but is also a hub for culture and arts, hosting the annual Ars Electronica Festival, which celebrates electronic arts. The city’s vibrant cultural scene and innovative spirit have earned it the title of UNESCO City of Media Arts.",
    "53":"Berlin, the capital of Germany, is a city steeped in history and culture. With a population of around 3.7 million, it is Germany's largest city. Berlin is famous for its historical landmarks such as the Brandenburg Gate, the Berlin Wall, and the Reichstag building. The city's diverse cultural scene includes world-class museums on Museum Island, vibrant neighborhoods like Kreuzberg and Friedrichshain, and a renowned nightlife. Berlin is also a center for politics, media, science, and creative industries, making it one of Europe’s most influential cities.",
    "54":"Hamburg, Germany's second-largest city, has a population of about 1.8 million. Located on the Elbe River, it is one of Europe’s busiest ports. Hamburg is known for its maritime heritage, the historic Speicherstadt warehouse district, and the modern HafenCity. The city offers a rich cultural scene with numerous theaters, music venues, and the renowned Elbphilharmonie concert hall. Hamburg's vibrant neighborhoods, such as St. Pauli and the Schanzenviertel, are famous for their nightlife and cultural diversity.",
    "55":"Munich, the capital of Bavaria, is Germany's third-largest city with a population of approximately 1.5 million. Known for its beautiful architecture, Munich is home to landmarks such as the Marienplatz, Nymphenburg Palace, and the Frauenkirche. The city is famous for its beer culture, particularly the annual Oktoberfest celebration. Munich is also a major center for art, technology, finance, and education. The city boasts numerous museums, art galleries, and a thriving cultural scene, making it one of Germany’s most attractive cities to live in.",
    "68":"Rome, the capital of Italy, is one of the most historically significant cities in the world. With a population of around 2.8 million, it is Italy’s largest city. Rome is renowned for its ancient history, featuring iconic landmarks such as the Colosseum, the Roman Forum, and the Pantheon. The Vatican City, an independent city-state within Rome, is the spiritual center for Catholics worldwide. Rome's rich cultural heritage is complemented by its art, architecture, and cuisine. The city's vibrant atmosphere, historical significance, and artistic legacy make it a major global destination.",
    "69":"Milan, located in northern Italy, is the country’s financial and fashion capital. With a population of about 1.4 million, Milan is known for its high-end fashion houses, upscale shops, and significant cultural heritage. Key landmarks include the Milan Cathedral (Duomo), the La Scala opera house, and Leonardo da Vinci’s mural, The Last Supper. Milan is a hub for business, design, and art, hosting events such as Milan Fashion Week and the Salone del Mobile. The city's blend of historical and modern attractions makes it a dynamic and influential metropolis.",
    "70":"Naples, situated on the southwestern coast of Italy, has a population of around 960,000. It is one of the oldest continuously inhabited cities in the world, known for its rich history and cultural significance. Naples boasts landmarks such as the Naples Cathedral, the Royal Palace, and the historic city center, a UNESCO World Heritage site. The city is also famous for its cuisine, particularly as the birthplace of pizza. Naples’ vibrant street life, historical treasures, and proximity to sites like Pompeii and the Amalfi Coast make it a fascinating destination.",
    "71":"Paris, the capital of France, is one of the most iconic cities in the world. With a population of over 2 million within the city proper and nearly 12 million in the metropolitan area, Paris is a major European cultural and economic center. The city is renowned for its art, fashion, gastronomy, and history. Landmarks such as the Eiffel Tower, the Louvre Museum, Notre-Dame Cathedral, and the Champs-Élysées draw millions of tourists each year. Paris is also known for its charming neighborhoods like Montmartre and Le Marais, offering a blend of historical and modern attractions. The city's vibrant cultural scene includes numerous theaters, music venues, and art galleries, making it a global hub of creativity and innovation.",
    "72":"Marseille, located on the southeastern coast of France, is the country’s second-largest city with a population of around 860,000. As a major Mediterranean port, Marseille has a rich maritime history and diverse cultural heritage. The city's iconic landmarks include the Old Port (Vieux-Port), the Basilique Notre-Dame de la Garde, and the historic Le Panier district. Marseille is known for its vibrant cultural scene, with numerous museums, theaters, and music festivals. Its unique blend of cultures, stemming from centuries of immigration, is reflected in its cuisine, architecture, and lively street life.",
    "73":"Lyon, situated in east-central France, is the country’s third-largest city with a population of about 515,000. Known for its historical and architectural landmarks, Lyon's Old Town (Vieux Lyon) is a UNESCO World Heritage site. The city is renowned for its cuisine, often considered the gastronomic capital of France, with numerous Michelin-starred restaurants and traditional bouchons. Key landmarks include the Basilica of Notre-Dame de Fourvière, the Presqu'île district, and the Traboules passageways. Lyon is also a major center for banking, pharmaceuticals, and biotechnology, making it an important economic hub.",
    "74":"Brussels, the capital of Belgium, has a population of about 1.2 million. It is not only the political center of Belgium but also serves as the de facto capital of the European Union, hosting major EU institutions. Brussels is known for its stunning architecture, including the Grand Place, a UNESCO World Heritage site, the Atomium, and the Royal Palace. The city boasts a rich cultural scene with numerous museums, theaters, and art galleries. Brussels is also famous for its culinary delights, particularly Belgian chocolates, waffles, and a wide variety of beers.",
    "75":"Antwerp, located in northern Belgium, is the country’s second-largest city with a population of around 530,000. Known for its port, one of the biggest in Europe, Antwerp is a major hub for trade and commerce. The city is famous for its diamond industry and rich cultural heritage. Key landmarks include the Cathedral of Our Lady, the Antwerp Zoo, and the Museum aan de Stroom (MAS). Antwerp’s vibrant cultural scene includes numerous art galleries, fashion boutiques, and theaters. The city is also renowned for its vibrant nightlife and culinary scene.",
    "76":"Ghent, situated in the Flanders region of Belgium, has a population of about 260,000. Known for its medieval architecture and vibrant cultural scene, Ghent is a city rich in history and modern charm. Landmarks include the Gravensteen castle, St. Bavo's Cathedral, and the picturesque Graslei and Korenlei canals. Ghent is also a university city, contributing to its lively atmosphere with numerous festivals, music events, and cultural activities. The city's mix of historical sites and contemporary culture makes it a unique destination in Belgium.",
    "77":"Amsterdam, the capital of the Netherlands, has a population of around 870,000. Known for its iconic canals, historic buildings, and vibrant cultural scene, Amsterdam is a city that blends tradition with modernity. Major attractions include the Anne Frank House, the Van Gogh Museum, the Rijksmuseum, and the lively Dam Square. Amsterdam is famous for its liberal attitudes, diverse neighborhoods, and bustling nightlife. The city’s extensive network of canals, cycling paths, and green spaces make it one of the most liveable cities in Europe.",
    "78":"Rotterdam, located in the western Netherlands, is the country’s second-largest city with a population of approximately 650,000. Known for its modern architecture and significant port, Rotterdam is a major hub for international trade and commerce. Key landmarks include the Cube Houses, the Erasmus Bridge, and the Markthal. The city is renowned for its innovative urban design, vibrant cultural scene, and numerous festivals. Rotterdam’s diverse population and dynamic atmosphere make it a vibrant and forward-looking city.",
    "79":"The Hague, situated on the western coast of the Netherlands, has a population of about 540,000. It is the seat of the Dutch government and home to the Royal Family, although it is not the capital. The Hague is known for its international institutions, including the International Court of Justice and the International Criminal Court. Key landmarks include the Binnenhof complex, the Peace Palace, and the Mauritshuis museum. The city boasts a rich cultural scene, beautiful parks, and a long coastline with popular beach resorts like Scheveningen.",
    "80":"Luxembourg City, the capital of Luxembourg, is known for its fortified medieval old town perched on sheer cliffs. The city is a significant financial center, home to numerous banks and financial institutions. Luxembourg City is famous for its high standard of living and beautiful scenery, including the picturesque Grund district and the Bock Casemates. The city's population is around 125,000, with a metropolitan area that includes over 600,000 residents. Luxembourg City is a cultural hub, offering a variety of museums, theaters, and music festivals, reflecting its rich history and multicultural population.",
    "81":"Esch-sur-Alzette is the second-largest city in Luxembourg, with a population of approximately 36,000. Located in the southwestern part of the country, it is known for its industrial heritage, particularly in steel production. The city has undergone significant regeneration in recent years, with new cultural institutions such as the Rockhal concert hall and the University of Luxembourg's Belval campus. Esch-sur-Alzette boasts a vibrant cultural scene, numerous parks, and modern urban development projects, making it a dynamic and evolving city.",
    "82":"Differdange, with a population of around 26,000, is one of Luxembourg's principal cities, located in the southwestern part of the country. It is known for its rich industrial history, especially in steel manufacturing. The city is home to the Miami University Dolibois European Center, an American university campus. Differdange has a mix of historical architecture and modern amenities, with numerous parks, cultural events, and sports facilities contributing to a high quality of life for its residents.",
    "83":"Ljubljana is the capital and largest city of Slovenia, with a population of around 295,000. The city is known for its green spaces, including the expansive Tivoli Park, and its vibrant cultural scene. Ljubljana's charming old town features picturesque baroque and art nouveau buildings, as well as the iconic Ljubljana Castle. The city is a significant educational and economic center, home to the University of Ljubljana. Its strategic location and rich cultural heritage make it an important hub in the region, blending historical charm with modern sophistication.",
    "84":"Maribor is the second-largest city in Slovenia, with a population of about 112,000. Located in the northeastern part of the country, it is known for its wine production, particularly the world's oldest vine, the Old Vine, which is over 400 years old. Maribor is a cultural and economic center, hosting events like the Lent Festival, one of the largest open-air festivals in Europe. The city is also known for its beautiful natural surroundings, including the Pohorje mountain range, which offers excellent opportunities for skiing and hiking.",
    "85":"Celje, with a population of approximately 38,000, is the third-largest city in Slovenia. It is situated in the eastern part of the country and is known for its rich history dating back to Roman times. The city's prominent landmarks include the Celje Castle and the medieval old town. Celje is a significant cultural and economic hub, with numerous museums, theaters, and educational institutions. Its location along the Savinja River and proximity to the Alps make it a popular destination for outdoor activities and tourism.",
    "86":"Bratislava, the capital of Slovakia, has a population of about 440,000. Located along the Danube River, it is the country's largest city and a significant cultural and economic center. Bratislava's historic old town features landmarks such as Bratislava Castle, St. Martin's Cathedral, and the Old Town Hall. The city is known for its vibrant arts scene, with numerous theaters, galleries, and music festivals. Bratislava's strategic location near the borders of Austria and Hungary makes it a crucial hub for commerce and international relations in Central Europe.",
    "87":"Košice is the second-largest city in Slovakia, with a population of around 240,000. Located in the eastern part of the country, it is known for its well-preserved historical center, including St. Elisabeth Cathedral, the largest church in Slovakia. Košice is a significant cultural and economic center, hosting events like the Košice Peace Marathon, the oldest marathon in Europe. The city's diverse cultural scene includes numerous theaters, museums, and galleries. Košice's blend of historical charm and modern amenities makes it an important destination in Slovakia.",
    "88":"Prešov, with a population of approximately 90,000, is the third-largest city in Slovakia. Located in the northeastern part of the country, it is known for its historical architecture, including the Cathedral of St. Nicholas and the historic old town. Prešov is a cultural and educational hub, home to several universities and cultural institutions. The city's vibrant arts scene includes theaters, galleries, and music festivals. Prešov's rich history, cultural diversity, and scenic surroundings make it a key city in Slovakia.",
    "89":"Prague, the capital city of the Czech Republic, is renowned for its stunning architecture, rich history, and vibrant cultural scene. With a population of approximately 1.3 million, Prague is a major European cultural and economic hub. The city's historic center, a UNESCO World Heritage Site, features iconic landmarks such as Prague Castle, Charles Bridge, and the Old Town Square with the Astronomical Clock. Known as \"The City of a Hundred Spires,\" Prague boasts a unique blend of Gothic, Baroque, and Renaissance architecture. The city is also famous for its lively arts scene, including numerous theaters, museums, and music festivals.",
    "90":"Brno is the second-largest city in the Czech Republic, with a population of about 380,000. It is an important cultural and economic center, known for its vibrant student population and rich historical heritage. Brno's landmarks include the Špilberk Castle, the Cathedral of St. Peter and Paul, and the functionalist Villa Tugendhat, a UNESCO World Heritage Site. The city hosts numerous cultural events, such as the International Fireworks Competition and the Brno Biennial of Graphic Design. Brno is also a significant center for science and technology, housing several universities and research institutions.",
    "91":"Ostrava is the third-largest city in the Czech Republic, with a population of around 290,000. Located in the northeastern part of the country, it is known for its industrial heritage and vibrant cultural scene. Ostrava's landmarks include the Lower Vítkovice industrial complex, which has been transformed into a cultural and educational center, and the historic Stodolní Street, famous for its nightlife. The city hosts several major cultural events, such as the Colours of Ostrava music festival and the Janáček Philharmonic Orchestra. Ostrava's dynamic blend of industrial history and modern cultural attractions makes it a unique destination.",
    "47":"Zagreb, the capital and largest city of Croatia, has a population of around 800,000. It is the country's political, economic, and cultural heart, known for its historic architecture, vibrant arts scene, and bustling street life. Key landmarks include the Gothic Zagreb Cathedral, the medieval Gornji Grad (Upper Town), and the lively Dolac Market. Zagreb is also renowned for its numerous museums, galleries, and theaters, as well as its annual events like the Zagreb Film Festival and the Advent in Zagreb Christmas market. The city's blend of historic charm and modern amenities makes it a major European destination.",
    "48":"Split is the second-largest city in Croatia, with a population of approximately 180,000. Located on the eastern shore of the Adriatic Sea, it is known for its stunning coastal scenery and rich history. The city's most famous landmark is Diocletian's Palace, a UNESCO World Heritage Site and one of the best-preserved Roman monuments in the world. Split's vibrant cultural scene includes numerous festivals, museums, and theaters, as well as its lively waterfront promenade, the Riva. The city's mix of ancient history, Mediterranean climate, and vibrant modern culture make it a popular tourist destination.",
    "49":"Rijeka, with a population of around 128,000, is Croatia's principal seaport and the third-largest city. Located on the Kvarner Bay, Rijeka is known for its maritime heritage and vibrant cultural life. The city's landmarks include Trsat Castle, the Governor's Palace, and the lively Korzo promenade. Rijeka hosts several major events, such as the Rijeka Carnival and the Hartera music festival. In 2020, Rijeka was named the European Capital of Culture, highlighting its rich cultural scene and historical significance. The city's blend of maritime tradition and modern cultural attractions make it a unique destination in Croatia.",
    "41":"Athens, the capital and largest city of Greece, has a population of around 3 million in its metropolitan area. Known as the cradle of Western civilization and the birthplace of democracy, Athens is famous for its ancient landmarks, including the Acropolis, the Parthenon, and the Ancient Agora. The city is a major cultural and economic center, with a vibrant arts scene, numerous museums, and bustling markets. Athens' rich history is complemented by its modern urban life, offering a unique blend of ancient and contemporary culture. The city's warm climate and dynamic atmosphere make it a major European destination.",
    "42":"Thessaloniki, the second-largest city in Greece, has a population of approximately 1 million in its metropolitan area. Located in northern Greece, it is known for its rich history, vibrant cultural scene, and lively nightlife. Key landmarks include the White Tower, the Rotunda, and the Archaeological Museum of Thessaloniki. The city's historic center, a UNESCO World Heritage Site, features a blend of Byzantine, Ottoman, and modern architecture. Thessaloniki hosts numerous cultural events, such as the Thessaloniki International Film Festival and the Dimitria Festival. The city's dynamic blend of history, culture, and modernity makes it a key destination in Greece.",
    "43":"Patras is the third-largest city in Greece, with a population of around 200,000. Located in the northern Peloponnese, it is known for its significant port and vibrant cultural life. Key landmarks include the Patras Castle, the Roman Odeon, and the Cathedral of Saint Andrew. Patras is famous for its lively carnival, one of the largest in Europe, featuring parades, music, and elaborate costumes. The city's blend of historical sites, cultural events, and modern amenities make it an important cultural and economic center in Greece.",
    "92":"Dublin, the capital and largest city of Ireland, is a vibrant and historic city with a population of approximately 1.4 million in its metropolitan area. Located on the east coast of Ireland, Dublin is renowned for its rich literary heritage, historic landmarks, and lively cultural scene. Key attractions include Trinity College, home to the Book of Kells, Dublin Castle, and the iconic Guinness Storehouse. The city boasts a bustling nightlife, with numerous pubs, music venues, and theaters. Dublin's blend of history, culture, and modern urban life makes it a major European destination.",
    "93":"Cork, the second-largest city in Ireland, has a population of around 210,000. Situated in the south of the country, Cork is known for its vibrant arts scene, historic architecture, and picturesque setting along the River Lee. Landmarks include the Gothic Revival St. Fin Barre's Cathedral, the historic English Market, and the Cork City Gaol. The city hosts various cultural events, such as the Cork Jazz Festival and the Cork Film Festival. Cork's combination of historic charm, cultural vibrancy, and beautiful scenery make it a key destination in Ireland.",
    "94":"Galway, located on the west coast of Ireland, has a population of approximately 80,000. Known for its lively arts scene, historic charm, and vibrant festivals, Galway is often referred to as Ireland's cultural heart. Key attractions include the Spanish Arch, Galway Cathedral, and the bustling Eyre Square. The city hosts numerous festivals, such as the Galway International Arts Festival and the Galway Races. Galway's rich cultural heritage, scenic coastal setting, and lively atmosphere make it a popular destination for both tourists and locals.",
    "62":"Lisbon, the capital and largest city of Portugal, has a population of around 2.8 million in its metropolitan area. Situated on the western coast of the Iberian Peninsula, Lisbon is known for its historic neighborhoods, scenic vistas, and vibrant cultural scene. Key landmarks include the Belém Tower, Jerónimos Monastery, and the São Jorge Castle. The city is famous for its music, particularly Fado, and hosts numerous cultural events, such as the Lisbon Book Fair and the Lisbon & Estoril Film Festival. Lisbon's blend of historic charm, cultural richness, and modern amenities make it a major European destination.",
    "63":"Porto, the second-largest city in Portugal, has a population of around 1.7 million in its metropolitan area. Located along the Douro River in northern Portugal, Porto is renowned for its historic center, a UNESCO World Heritage Site, and its famous port wine. Key landmarks include the Ribeira district, the Clérigos Tower, and the Dom Luís I Bridge. The city hosts various cultural events, such as the Porto International Film Festival and the São João Festival. Porto's combination of historic charm, scenic beauty, and cultural vibrancy make it a key destination in Portugal.",
    "64":"Vila Nova de Gaia, commonly known as Gaia, is a city in northern Portugal, situated just across the Douro River from Porto. With a population of approximately 300,000, Gaia is famous for its port wine cellars, where the famous port wine is aged and stored. Key attractions include the Serra do Pilar Monastery, the Cais de Gaia waterfront, and the sandy beaches along the Atlantic coast. Gaia offers stunning views of Porto and hosts various cultural and wine-related events. The city's unique blend of wine heritage, scenic beauty, and cultural attractions make it a significant destination in Portugal.",
    "50":"Budapest, the capital and largest city of Hungary, has a population of around 1.7 million. Straddling the Danube River, Budapest is known for its stunning architecture, historic thermal baths, and vibrant cultural scene. Key landmarks include the Buda Castle, the Hungarian Parliament Building, and the Chain Bridge. The city's historic thermal baths, such as Széchenyi and Gellért, are renowned worldwide. Budapest hosts numerous cultural events, such as the Budapest International Film Festival and the Sziget Music Festival. The city's rich history, architectural beauty, and lively cultural life make it a major European destination.",
    "51":"Debrecen is the second-largest city in Hungary, with a population of around 200,000. Located in the eastern part of the country, Debrecen is known for its cultural and educational significance. Key landmarks include the Great Reformed Church, the Déri Museum, and the Nagyerdő Park. The city hosts various cultural events, such as the Debrecen Flower Carnival and the Bartók Plus Opera Festival. Debrecen's blend of historic charm, cultural vibrancy, and modern amenities make it an important center in Hungary.",
    "52":"Szeged, the third-largest city in Hungary, has a population of approximately 160,000. Situated in the southern part of the country, Szeged is known for its beautiful architecture, vibrant cultural scene, and renowned universities. Key landmarks include the Votive Church, the Szeged Synagogue, and the Széchenyi Square. The city hosts numerous cultural events, such as the Szeged Open-Air Festival and the International Tisza Fish Festival. Szeged's combination of historic charm, cultural richness, and academic significance make it a key destination in Hungary.",
    "59":"Madrid, the capital and largest city of Spain, has a population of approximately 3.3 million in its metropolitan area. Located in the heart of the Iberian Peninsula, Madrid is known for its rich cultural heritage, stunning architecture, and vibrant nightlife. Key landmarks include the Royal Palace of Madrid, the Prado Museum, and the Puerta del Sol square. The city hosts numerous cultural events, such as the San Isidro Festival and Madrid Fashion Week. Madrid's blend of historic charm, cultural richness, and modernity makes it a major European destination.",
    "60":"Barcelona, the capital and largest city of Catalonia, has a population of around 5.6 million in its metropolitan area. Situated on the northeastern coast of Spain, Barcelona is renowned for its unique blend of Gothic and modernist architecture, including the Sagrada Família and Park Güell. The city is famous for its vibrant street life, beaches along the Mediterranean coast, and lively cultural scene. Barcelona hosts various cultural events, such as the Primavera Sound Festival and the La Mercè Festival. Barcelona's cultural diversity, architectural splendor, and Mediterranean charm make it a global city.",
    "61":"Las Palmas de Gran Canaria, often referred to as Las Palmas, is the capital city of Gran Canaria, one of Spain's Canary Islands. With a population of around 380,000, Las Palmas is known for its beautiful beaches, historic architecture, and lively atmosphere. Key attractions include the Vegueta district, the Cathedral of Santa Ana, and the Las Canteras beach. The city hosts various cultural events, such as the Carnival of Las Palmas and the WOMAD music festival. Las Palmas' mix of sunshine, cultural heritage, and island charm make it a popular destination in Spain.",
    "95":"Stockholm, the capital and largest city of Sweden, has a population of approximately 1.6 million in its metropolitan area. Spread across 14 islands on the Baltic Sea, Stockholm is known for its stunning architecture, historic Old Town (Gamla Stan), and vibrant cultural scene. Key landmarks include the Royal Palace, the Vasa Museum, and the City Hall. The city hosts various cultural events, such as the Nobel Prize ceremonies and the Stockholm International Film Festival. Stockholm's blend of natural beauty, cultural richness, and Scandinavian style make it a prominent European capital.",
    "96":"Gothenburg, the second-largest city in Sweden, has a population of around 1.1 million in its metropolitan area. Located on the west coast of Sweden, Gothenburg is known for its picturesque canals, historic neighborhoods, and vibrant cultural scene. Key attractions include the Liseberg amusement park, the Gothenburg Museum of Art, and the Haga district. The city hosts various cultural events, such as the Gothenburg Film Festival and the Way Out West music festival. Gothenburg's maritime heritage, cultural diversity, and dynamic atmosphere make it a key destination in Scandinavia.",
    "97":"Malmö, the third-largest city in Sweden, has a population of approximately 340,000. Situated in the southern part of Sweden, Malmö is known for its modern architecture, diverse cultural scene, and proximity to Copenhagen, Denmark. Key landmarks include the Turning Torso skyscraper, Malmö Castle, and the Western Harbour district. The city hosts various cultural events, such as the Malmö Festival and the Nordic Game conference. Malmö's blend of Scandinavian charm, cosmopolitan atmosphere, and cultural vibrancy make it a significant city in the Öresund Region.",
    "98":"Valletta is the capital city of Malta, with a population of around 6,500. Located on the northeastern coast of the island of Malta, Valletta is known for its rich history, Baroque architecture, and UNESCO World Heritage status. Key landmarks include St. John's Co-Cathedral, the Grandmaster's Palace, and the Upper Barrakka Gardens. The city hosts various cultural events, such as the Valletta International Baroque Festival and the Malta International Arts Festival. Valletta's historic charm, architectural beauty, and cultural significance make it a captivating destination in the Mediterranean.",
    "99":"Birkirkara is one of the largest cities in Malta, with a population of approximately 25,000. Located in the central part of the island of Malta, Birkirkara is known for its residential neighborhoods, historic churches, and community spirit. Key landmarks include St. Helen's Basilica, the Birkirkara Old Railway Station, and the Villa Messina. The city hosts various cultural and religious events throughout the year. Birkirkara's blend of Maltese heritage, local charm, and community-focused atmosphere make it an important city on the island.",
    "100":"Mosta is a town in central Malta, with a population of around 20,000. Known for its iconic Rotunda of Mosta, one of the largest domes in Europe, Mosta is a historic town with a strong sense of community. Key landmarks include the Mosta Parish Church, the Villa Abela, and the Mdina Road Chapel. The town celebrates various cultural and religious events, such as the Mosta Festival and religious processions. Mosta's blend of historic architecture, local traditions, and community spirit make it a distinctive town in Malta.",
    "101":"Riga is the capital and largest city of Latvia, with a population of approximately 630,000. Situated on the Gulf of Riga, the city is known for its well-preserved medieval Old Town, designated as a UNESCO World Heritage site. Key landmarks include the Riga Cathedral, the Freedom Monument, and the Latvian National Museum of Art. Riga hosts various cultural events, such as the Riga Opera Festival and the Riga City Festival. The city's blend of historic charm, Art Nouveau architecture, and vibrant cultural scene make it a prominent Baltic capital.",
    "102":"Daugavpils is the second-largest city in Latvia, with a population of around 80,000. Located in the southeastern part of Latvia, Daugavpils is known for its historic landmarks, including the Daugavpils Fortress and the Mark Rothko Art Centre, dedicated to the famous abstract expressionist painter. The city's cultural diversity, with significant Russian and Latvian communities, contributes to its unique atmosphere. Daugavpils hosts various cultural events, such as the Daugavpils City Festival and the Mark Rothko Art Festival. The city's blend of history, cultural heritage, and artistic expression makes it a notable destination in Latvia.",
    "103":"Liepaja is a city in western Latvia, with a population of approximately 70,000. Situated on the Baltic Sea coast, Liepaja is known for its sandy beaches, Art Nouveau architecture, and vibrant cultural scene. Key landmarks include Liepaja's Northern Forts, the Seaside Park, and the St. Nicholas Orthodox Naval Cathedral. The city hosts various cultural events, such as the Liepaja Summer Sound Festival and the International Organ Music Festival. Liepaja's maritime heritage, musical traditions, and scenic coastal landscapes make it a popular destination in Latvia.",
    "104":"Vilnius is the capital and largest city of Lithuania, with a population of around 580,000. Located in southeastern Lithuania, Vilnius is known for its picturesque Old Town, a UNESCO World Heritage site, with its Baroque architecture and medieval streets. Key landmarks include Vilnius Cathedral, Gediminas' Tower, and the Gate of Dawn. Vilnius hosts various cultural events, such as the Vilnius Festival and the International Film Festival Kino Pavasaris. The city's blend of history, cultural richness, and artistic creativity makes it a vibrant European capital.",
    "105":"Kaunas is the second-largest city in Lithuania, with a population of approximately 290,000. Situated at the confluence of the Nemunas and Neris rivers, Kaunas is known for its historic Old Town, Gothic architecture, and green spaces. Key landmarks include Kaunas Castle, the Ninth Fort Museum, and the Vytautas the Great War Museum. Kaunas hosts various cultural events, such as the Kaunas Jazz Festival and the Pažaislis Music Festival. The city's blend of history, artistic expression, and natural beauty makes it a cultural hub in Lithuania.",
    "106":"Klaipeda is a port city in western Lithuania, with a population of around 150,000. Located on the Baltic Sea coast, Klaipeda is known for its historic Old Town, German architecture, and maritime heritage. Key landmarks include Klaipeda Castle, the Old Ferry Terminal, and the Curonian Spit National Park. The city hosts various cultural events, such as the Sea Festival and the International Theatre Festival. Klaipeda's blend of history, coastal charm, and cultural diversity makes it a distinctive city in Lithuania.",
    "107":"Tallinn is the capital and largest city of Estonia, with a population of approximately 450,000. Situated on the northern coast of Estonia, Tallinn is known for its well-preserved medieval Old Town, a UNESCO World Heritage site, with its cobblestone streets and historic landmarks. Key landmarks include Toompea Castle, Alexander Nevsky Cathedral, and Kadriorg Palace. Tallinn hosts various cultural events, such as the Tallinn Music Week and the Old Town Days. The city's blend of medieval charm, technological innovation, and cultural vibrancy makes it a dynamic Baltic capital.",
    "108":"Tartu is the second-largest city in Estonia, with a population of around 100,000. Located in southeastern Estonia, Tartu is known for its prestigious University of Tartu, founded in 1632, and its historic Old Town. Key landmarks include the University of Tartu Museum, Tartu Cathedral, and the Toomemägi Park. Tartu hosts various cultural events, such as the Tartu Hansa Days and the Tartu Student Days. The city's blend of academic excellence, cultural heritage, and youthful atmosphere makes it a prominent cultural and educational center in Estonia.",
    "109":"Narva is a city in northeastern Estonia, on the border with Russia, with a population of approximately 55,000. Known for its medieval Narva Castle, the city has a rich history influenced by its strategic location on the Narva River. Key landmarks include the Hermann Castle, the Narva Town Hall, and the Narva Museum. Narva hosts various cultural events, such as the Narva Opera Days and the Narva Battle Reenactment. The city's blend of historical significance, architectural heritage, and cultural diversity makes it a unique destination in northeastern Estonia.",
    "110":"Copenhagen is the capital and largest city of Denmark, with a population of approximately 800,000. Situated on the eastern coast of the island of Zealand, Copenhagen is known for its picturesque harbor, historic landmarks, and vibrant cultural scene. Key landmarks include the Nyhavn waterfront, the Little Mermaid statue, and the Tivoli Gardens amusement park. Copenhagen hosts various cultural events, such as the Copenhagen Jazz Festival and the Copenhagen Cooking & Food Festival. The city's blend of historic charm, modern architecture, and progressive urban planning makes it a dynamic Scandinavian capital.",
    "111":"Aarhus is the second-largest city in Denmark, with a population of around 350,000. Located on the eastern coast of the Jutland peninsula, Aarhus is known for its innovative architecture, historic Old Town, and thriving arts scene. Key landmarks include Aarhus Cathedral, ARoS Aarhus Art Museum, and the Aarhus Theatre. Aarhus hosts various cultural events, such as the Aarhus Festival and the SPOT Festival. The city's blend of cultural richness, academic institutions, and coastal landscapes makes it a cultural hub in Denmark.",
    "112":"Odense is the third-largest city in Denmark, with a population of approximately 210,000. Situated on the island of Funen, Odense is known for its connection to the famous author Hans Christian Andersen, who was born there. Key landmarks include the Hans Christian Andersen Museum, Odense Cathedral, and the Odense Zoo. Odense hosts various cultural events, such as the Odense International Film Festival and the Tinderbox Music Festival. The city's blend of literary heritage, green spaces, and cultural activities makes it a charming destination in Denmark.",
    "113":"Nicosia is the capital and largest city of Cyprus, with a population of around 300,000. Located in the central part of Cyprus, Nicosia is known for its historic city walls, divided between the Greek Cypriot and Turkish Cypriot communities since 1974. Key landmarks include the Cyprus Museum, Selimiye Mosque, and the Famagusta Gate. Nicosia hosts various cultural events, such as the Nicosia International Festival and the Cyprus Film Days. The city's blend of history, cultural diversity, and political significance makes it a unique capital in the Eastern Mediterranean.",
    "114":"Limassol is a city on the southern coast of Cyprus, with a population of approximately 240,000. Known for its vibrant nightlife, sandy beaches, and cultural festivals, Limassol is a popular tourist destination. Key landmarks include Limassol Castle, the Limassol Marina, and the Archaeological Museum. Limassol hosts various cultural events, such as the Limassol Wine Festival and the Limassol Carnival. The city's blend of historical landmarks, cosmopolitan atmosphere, and Mediterranean charm makes it a lively city on the island of Cyprus.",
    "115":"Larnaca is a city on the southern coast of Cyprus, with a population of around 150,000. Known for its palm-lined seafront promenade, Larnaca is a hub of tourism and commerce. Key landmarks include Larnaca Salt Lake, Hala Sultan Tekke Mosque, and the Larnaca Fort. Larnaca hosts various cultural events, such as the Kataklysmos Festival and the Larnaca Carnival. The city's blend of historical sites, coastal beauty, and modern amenities makes it a popular destination for both tourists and residents on the island of Cyprus.",
    "116":"Helsinki is the capital and largest city of Finland, with a population of approximately 650,000. Situated on the southern coast of Finland, Helsinki is known for its neoclassical architecture, vibrant design scene, and cultural attractions. Key landmarks include Helsinki Cathedral, Suomenlinna Sea Fortress, and the Design Museum. Helsinki hosts various cultural events, such as the Helsinki Festival and the Lux Helsinki light festival. The city's blend of urban sophistication, maritime heritage, and natural beauty makes it a dynamic Nordic capital.",
    "117":"Espoo is the second-largest city in Finland, part of the Greater Helsinki metropolitan area, with a population of around 290,000. Known for its high standard of living, Espoo combines urban amenities with natural landscapes and cultural attractions. Key landmarks include the Espoo Cathedral, Nuuksio National Park, and the WeeGee Exhibition Centre. Espoo hosts various cultural events, such as the April Jazz Festival and the Espoo Ciné International Film Festival. The city's blend of technology innovation, environmental sustainability, and cultural diversity makes it a modern and innovative city in Finland.",
    "118":"Tampere is the third-largest city in Finland, located between two lakes, Näsijärvi and Pyhäjärvi, with a population of approximately 240,000. Known for its industrial history, Tampere has transformed into a cultural and educational hub. Key landmarks include Tampere Cathedral, the Moomin Museum, and the Tampere Theatre. Tampere hosts various cultural events, such as the Tampere Theatre Festival and the Tampere Jazz Happening. The city's blend of industrial heritage, natural beauty, and cultural vibrancy makes it a distinctive city in Finland."
}