{
    "RO": "Romania is a diverse and vibrant country located in Southeastern Europe, known for its rich history, stunning landscapes, and cultural heritage. It is bordered by Hungary to the west, Serbia to the southwest, Bulgaria to the south, the Black Sea to the southeast, Ukraine to the north, and Moldova to the east. The country's capital, Bucharest, is often called \"Little Paris\" for its elegant architecture and bustling atmosphere. Romania is renowned for the Carpathian Mountains, offering breathtaking hiking opportunities and winter sports, as well as the iconic region of Transylvania, famous for its medieval castles and legends of Dracula. The Danube River flows along Romania's southern border, culminating in the unique and biodiverse Danube Delta. With a rich tapestry of traditions, folklore, and modern development, Romania offers a fascinating blend of the old and the new.",
    "AT": "Austria, located in Central Europe, is celebrated for its alpine scenery, cultural events, and historic cities. Bordered by Germany, the Czech Republic, Slovakia, Hungary, Slovenia, Italy, Switzerland, and Liechtenstein, Austria's capital, Vienna, is famous for its classical music heritage and imperial history. The Austrian Alps offer exceptional skiing, hiking, and mountaineering opportunities. The country's rich history is reflected in its baroque architecture, palaces, and museums. Known for its quality of life, Austria combines natural beauty with cultural sophistication.",
    "BE": "Belgium, a small but densely populated country in Western Europe, is known for its medieval towns, Renaissance architecture, and as the headquarters of the European Union and NATO. Bordered by France, the Netherlands, Germany, and Luxembourg, Belgium's capital, Brussels, is a major international political hub. The country is famous for its beer, chocolate, waffles, and fries. It has a rich history with numerous castles, cathedrals, and museums. Belgium's diverse culture is influenced by its three main regions: Flanders, Wallonia, and the Brussels-Capital Region.",
    "BG": "Bulgaria, located in Southeast Europe, is known for its diverse landscapes, from mountains and plains to its Black Sea coastline. Bordered by Romania, Serbia, North Macedonia, Greece, and Turkey, its capital, Sofia, is one of the oldest cities in Europe with a history dating back to the 5th century BC. Bulgaria is famous for its rich folklore, traditional music, and dances. The country boasts numerous historical sites, including ancient Thracian tombs, medieval fortresses, and orthodox monasteries. Bulgaria's natural beauty includes the Rila Monastery and the picturesque town of Plovdiv.",
    "HR": "Croatia, situated along the Adriatic Sea in Southeast Europe, is known for its stunning coastline, islands, and historic towns. Bordered by Slovenia, Hungary, Serbia, Bosnia and Herzegovina, and Montenegro, Croatia's capital, Zagreb, blends historical charm with modern amenities. The country is renowned for its medieval walled city of Dubrovnik, a UNESCO World Heritage site. Croatia's natural beauty includes national parks such as Plitvice Lakes and Krka, offering waterfalls, lakes, and hiking trails. The country's rich cultural heritage is reflected in its festivals, music, and cuisine.",
    "CY": "Cyprus, an island nation in the Eastern Mediterranean, is known for its sunny climate, beautiful beaches, and ancient history. The third-largest and third-most populous island in the Mediterranean, its capital, Nicosia, is the only divided capital in Europe, shared between the Greek Cypriot and Turkish Cypriot communities. Cyprus boasts a rich cultural heritage with archaeological sites such as the ancient city of Kourion and the Tombs of the Kings. The island's diverse landscapes include mountains, forests, and a rugged coastline, making it a popular tourist destination.",
    "CZ": "The Czech Republic, located in Central Europe, is known for its picturesque towns, historic castles, and vibrant cultural scene. Bordered by Germany, Austria, Slovakia, and Poland, its capital, Prague, is famous for its old town square, Charles Bridge, and gothic architecture. The Czech Republic is renowned for its beer, being one of the largest beer consumers in the world. The country's rich history is evident in its numerous UNESCO World Heritage sites, including Český Krumlov and Kutná Hora. The Bohemian and Moravian regions offer beautiful landscapes, including forests, mountains, and rivers.",
    "DK": "Denmark, located in Northern Europe, is known for its high quality of life, modern design, and maritime heritage. Bordered by Germany to the south and surrounded by the North Sea and the Baltic Sea, its capital, Copenhagen, is famous for its blend of historic charm and modern architecture. Denmark is a leader in renewable energy and sustainability. The country boasts a rich Viking history, with many museums and archaeological sites. Denmark's natural beauty includes sandy beaches, rolling hills, and picturesque islands, making it a popular destination for outdoor activities.",
    "EE": "Estonia, located in Northern Europe, is known for its digital innovation, medieval architecture, and pristine nature. Bordered by the Baltic Sea, Latvia, and Russia, its capital, Tallinn, is famous for its well-preserved old town, a UNESCO World Heritage site. Estonia is a pioneer in e-governance and technology, often referred to as the world's most digitally advanced society. The country boasts a rich cultural heritage with numerous festivals, folk traditions, and a vibrant arts scene. Estonia's natural beauty includes forests, lakes, and a coastline dotted with islands and sandy beaches.",
    "FI": "Finland, located in Northern Europe, is known for its stunning natural landscapes, high quality of life, and education system. Bordered by Sweden, Norway, and Russia, its capital, Helsinki, is renowned for its modern design, architecture, and vibrant cultural scene. Finland is famous for its thousands of lakes, forests, and the Northern Lights. The country is a leader in technology and innovation, home to global companies like Nokia. Finnish culture is characterized by its saunas, unique cuisine, and a strong connection to nature, making it a popular destination for outdoor enthusiasts.",
    "FR": "France, located in Western Europe, is known for its rich history, cultural heritage, and diverse landscapes. Bordered by Belgium, Luxembourg, Germany, Switzerland, Italy, Monaco, Spain, and Andorra, its capital, Paris, is renowned for its art, fashion, and iconic landmarks such as the Eiffel Tower and the Louvre. France boasts a diverse geography, from the beaches of the French Riviera to the alpine peaks of the French Alps and the lush vineyards of Bordeaux. The country is famous for its cuisine, wine, and influential contributions to art, philosophy, and science.",
    "DE": "Germany, located in Central Europe, is known for its economic strength, cultural heritage, and historical significance. Bordered by Denmark, Poland, Czech Republic, Austria, Switzerland, France, Luxembourg, Belgium, and the Netherlands, its capital, Berlin, is famous for its vibrant arts scene, historic sites, and diverse architecture. Germany is renowned for its engineering, automotive industry, and technological innovation. The country's rich history is reflected in its numerous castles, museums, and historic towns. Germany's natural beauty includes the Black Forest, Rhine Valley, and Bavarian Alps.",
    "GR": "Greece, located in Southeastern Europe, is known for its ancient history, beautiful islands, and rich cultural heritage. Bordered by Albania, North Macedonia, Bulgaria, and Turkey, its capital, Athens, is famous for its ancient ruins, including the Acropolis and Parthenon. Greece boasts a diverse geography, with mountains, forests, and a coastline dotted with islands and beaches. The country is renowned for its mythology, philosophy, and contributions to democracy and science. Greek cuisine, with its emphasis on fresh ingredients and Mediterranean flavors, is celebrated worldwide.",
    "HU": "Hungary, located in Central Europe, is known for its rich history, thermal baths, and vibrant cultural scene. Bordered by Austria, Slovakia, Ukraine, Romania, Serbia, Croatia, and Slovenia, its capital, Budapest, is famous for its stunning architecture, historic thermal baths, and the scenic Danube River. Hungary's rich history is reflected in its castles, fortresses, and traditional festivals. The country is renowned for its cuisine, including dishes like goulash and paprika-spiced foods. Hungary's diverse landscapes include the Great Hungarian Plain, Lake Balaton, and the Bükk Mountains.",
    "IE": "Ireland, located in Western Europe, is known for its lush landscapes, rich cultural heritage, and friendly people. An island nation, it is bordered by the Atlantic Ocean, Irish Sea, and Celtic Sea. Its capital, Dublin, is famous for its literary history, vibrant nightlife, and historic landmarks. Ireland boasts a diverse geography, with rolling green hills, rugged coastlines, and picturesque lakes. The country is renowned for its folklore, traditional music, and festivals. Irish culture is characterized by its unique language, Gaelic sports, and a strong sense of community.",
    "IT": "Italy, located in Southern Europe, is known for its rich history, cultural heritage, and diverse landscapes. Bordered by France, Switzerland, Austria, and Slovenia, its capital, Rome, is famous for its ancient ruins, including the Colosseum and the Vatican. Italy boasts a diverse geography, from the alpine peaks of the Dolomites to the rolling hills of Tuscany and the picturesque Amalfi Coast. The country is renowned for its cuisine, fashion, and contributions to art and science. Italy's cultural heritage includes numerous UNESCO World Heritage sites, historic cities, and vibrant traditions.",
    "LV": "Latvia, located in Northern Europe, is known for its natural beauty, rich cultural heritage, and vibrant capital. Bordered by Estonia, Lithuania, Russia, and Belarus, its capital, Riga, is famous for its Art Nouveau architecture, historic old town, and lively cultural scene. Latvia boasts a diverse geography, with forests, lakes, and a long Baltic Sea coastline. The country is renowned for its folklore, traditional music, and festivals. Latvian culture is characterized by its strong sense of national identity, unique language, and a deep connection to nature.",
    "LT": "Lithuania, located in Northern Europe, is known for its rich history, natural beauty, and vibrant cultural scene. Bordered by Latvia, Belarus, Poland, and Russia, its capital, Vilnius, is famous for its baroque architecture, historic old town, and vibrant arts scene. Lithuania boasts a diverse geography, with forests, lakes, and a Baltic Sea coastline. The country is renowned for its folklore, traditional music, and festivals. Lithuanian culture is characterized by its unique language, strong sense of national identity, and a deep connection to nature.",
    "LU": "Luxembourg, a small but wealthy country in Western Europe, is known for its high quality of life, historic sites, and financial industry. Bordered by Belgium, Germany, and France, its capital, Luxembourg City, is famous for its medieval old town, fortifications, and modern architecture. Luxembourg boasts a diverse geography, with rolling hills, forests, and picturesque valleys. The country is renowned for its multilingualism, with Luxembourgish, French, and German as official languages. Luxembourg's rich history and cultural heritage are reflected in its castles, museums, and festivals.",
    "MT": "Malta, an island nation in the Mediterranean, is known for its rich history, beautiful coastline, and warm climate. Located south of Italy, Malta's capital, Valletta, is famous for its baroque architecture, historic fortifications, and vibrant cultural scene. Malta boasts a diverse geography, with rocky coastlines, sandy beaches, and clear blue waters. The country is renowned for its prehistoric temples, medieval towns, and a unique blend of cultures. Maltese cuisine, influenced by Mediterranean flavors, is celebrated for its fresh seafood and traditional dishes.",
    "NL": "The Netherlands, located in Western Europe, is known for its flat landscape, extensive canal systems, and vibrant cities. Bordered by Germany and Belgium, its capital, Amsterdam, is famous for its historic canals, museums, and liberal atmosphere. The Netherlands boasts a diverse geography, with tulip fields, windmills, and a North Sea coastline. The country is renowned for its cycling culture, innovative water management, and contributions to art and science. Dutch culture is characterized by its openness, tolerance, and a strong sense of community.",
    "PL": "Poland, located in Central Europe, is known for its rich history, cultural heritage, and diverse landscapes. Bordered by Germany, Czech Republic, Slovakia, Ukraine, Belarus, Lithuania, and Russia, its capital, Warsaw, is famous for its historic old town, vibrant arts scene, and resilient spirit. Poland boasts a diverse geography, with mountains, forests, and a Baltic Sea coastline. The country is renowned for its folklore, traditional music, and festivals. Polish cuisine, with its hearty dishes and flavors, is celebrated for its unique tastes and culinary traditions.",
    "PT": "Portugal, located in Southwestern Europe, is known for its rich history, beautiful coastline, and vibrant culture. Bordered by Spain and the Atlantic Ocean, its capital, Lisbon, is famous for its historic neighborhoods, tram rides, and scenic viewpoints. Portugal boasts a diverse geography, with mountains, rolling plains, and a long Atlantic coastline. The country is renowned for its exploration history, traditional music, and delicious cuisine. Portuguese culture is characterized by its unique language, architectural styles, and a deep connection to the sea.",
    "SK": "Slovakia, located in Central Europe, is known for its natural beauty, historic towns, and rich cultural heritage. Bordered by Poland, Ukraine, Hungary, Austria, and the Czech Republic, its capital, Bratislava, is famous for its medieval old town, castle, and vibrant cultural scene. Slovakia boasts a diverse geography, with mountains, forests, and rivers. The country is renowned for its folklore, traditional music, and festivals. Slovak culture is characterized by its unique language, traditional crafts, and a deep connection to nature.",
    "SI": "Slovenia, located in Central Europe, is known for its stunning landscapes, rich history, and vibrant culture. Bordered by Italy, Austria, Hungary, and Croatia, its capital, Ljubljana, is famous for its charming old town, castle, and lively cultural scene. Slovenia boasts a diverse geography, with mountains, lakes, and a small Adriatic coastline. The country is renowned for its outdoor activities, including hiking, skiing, and water sports. Slovenian culture is characterized by its unique language, traditional crafts, and a strong sense of national identity.",
    "ES": "Spain, located in Southwestern Europe, is known for its rich history, diverse cultures, and vibrant cities. Bordered by Portugal, France, Andorra, and the Mediterranean Sea, its capital, Madrid, is famous for its art museums, historic architecture, and lively atmosphere. Spain boasts a diverse geography, with mountains, plains, and a long coastline. The country is renowned for its festivals, flamenco music, and delicious cuisine. Spanish culture is characterized by its unique regional identities, language variations, and a strong sense of tradition.",
    "SE": "Sweden, located in Northern Europe, is known for its high quality of life, stunning landscapes, and innovative design. Bordered by Norway and Finland, its capital, Stockholm, is famous for its archipelago, historic old town, and modern architecture. Sweden boasts a diverse geography, with forests, lakes, and a long Baltic Sea coastline. The country is renowned for its technological advancements, social welfare system, and contributions to art and science. Swedish culture is characterized by its emphasis on equality, sustainability, and a strong connection to nature."
  }
  